{
    "ds_description": "(4) Full mnist rotations -0 -90 -180 -270, sizes allocated randomly",
    "num_clusters": 4,
    "num_classes": 10,
    "num_clients": 100,
    "num_samples_min": 200,
    "num_samples_max": 301,
    "num_samples_test_each": 10000,
    "client_tags": {
        "client_0": "Mixture of mnist and 3 other mnist rotation data. 26 full mnist-0, 76 full mnist-90, 138 full mnist-180. 11 full mnist-270 total 251 data points.",
        "client_1": "Mixture of mnist and 3 other mnist rotation data. 105 full mnist-0, 64 full mnist-90, 84 full mnist-180. 8 full mnist-270 total 261 data points.",
        "client_2": "Mixture of mnist and 3 other mnist rotation data. 96 full mnist-0, 101 full mnist-90, 27 full mnist-180. 32 full mnist-270 total 256 data points.",
        "client_3": "Mixture of mnist and 3 other mnist rotation data. 9 full mnist-0, 40 full mnist-90, 89 full mnist-180. 89 full mnist-270 total 227 data points.",
        "client_4": "Mixture of mnist and 3 other mnist rotation data. 94 full mnist-0, 25 full mnist-90, 86 full mnist-180. 88 full mnist-270 total 293 data points.",
        "client_5": "Mixture of mnist and 3 other mnist rotation data. 142 full mnist-0, 55 full mnist-90, 59 full mnist-180. 31 full mnist-270 total 287 data points.",
        "client_6": "Mixture of mnist and 3 other mnist rotation data. 133 full mnist-0, 18 full mnist-90, 37 full mnist-180. 59 full mnist-270 total 247 data points.",
        "client_7": "Mixture of mnist and 3 other mnist rotation data. 162 full mnist-0, 15 full mnist-90, 10 full mnist-180. 101 full mnist-270 total 288 data points.",
        "client_8": "Mixture of mnist and 3 other mnist rotation data. 195 full mnist-0, 6 full mnist-90, 37 full mnist-180. 5 full mnist-270 total 243 data points.",
        "client_9": "Mixture of mnist and 3 other mnist rotation data. 31 full mnist-0, 129 full mnist-90, 56 full mnist-180. 77 full mnist-270 total 293 data points.",
        "client_10": "Mixture of mnist and 3 other mnist rotation data. 23 full mnist-0, 148 full mnist-90, 35 full mnist-180. 27 full mnist-270 total 233 data points.",
        "client_11": "Mixture of mnist and 3 other mnist rotation data. 106 full mnist-0, 112 full mnist-90, 56 full mnist-180. 6 full mnist-270 total 280 data points.",
        "client_12": "Mixture of mnist and 3 other mnist rotation data. 66 full mnist-0, 6 full mnist-90, 96 full mnist-180. 52 full mnist-270 total 220 data points.",
        "client_13": "Mixture of mnist and 3 other mnist rotation data. 134 full mnist-0, 46 full mnist-90, 33 full mnist-180. 16 full mnist-270 total 229 data points.",
        "client_14": "Mixture of mnist and 3 other mnist rotation data. 40 full mnist-0, 25 full mnist-90, 147 full mnist-180. 85 full mnist-270 total 297 data points.",
        "client_15": "Mixture of mnist and 3 other mnist rotation data. 29 full mnist-0, 83 full mnist-90, 57 full mnist-180. 54 full mnist-270 total 223 data points.",
        "client_16": "Mixture of mnist and 3 other mnist rotation data. 6 full mnist-0, 68 full mnist-90, 98 full mnist-180. 67 full mnist-270 total 239 data points.",
        "client_17": "Mixture of mnist and 3 other mnist rotation data. 68 full mnist-0, 24 full mnist-90, 36 full mnist-180. 129 full mnist-270 total 257 data points.",
        "client_18": "Mixture of mnist and 3 other mnist rotation data. 193 full mnist-0, 20 full mnist-90, 6 full mnist-180. 22 full mnist-270 total 241 data points.",
        "client_19": "Mixture of mnist and 3 other mnist rotation data. 27 full mnist-0, 114 full mnist-90, 137 full mnist-180. 19 full mnist-270 total 297 data points.",
        "client_20": "Mixture of mnist and 3 other mnist rotation data. 179 full mnist-0, 58 full mnist-90, 58 full mnist-180. 3 full mnist-270 total 298 data points.",
        "client_21": "Mixture of mnist and 3 other mnist rotation data. 40 full mnist-0, 52 full mnist-90, 62 full mnist-180. 66 full mnist-270 total 220 data points.",
        "client_22": "Mixture of mnist and 3 other mnist rotation data. 43 full mnist-0, 175 full mnist-90, 13 full mnist-180. 19 full mnist-270 total 250 data points.",
        "client_23": "Mixture of mnist and 3 other mnist rotation data. 80 full mnist-0, 168 full mnist-90, 26 full mnist-180. 26 full mnist-270 total 300 data points.",
        "client_24": "Mixture of mnist and 3 other mnist rotation data. 36 full mnist-0, 112 full mnist-90, 107 full mnist-180. 8 full mnist-270 total 263 data points.",
        "client_25": "Mixture of mnist and 3 other mnist rotation data. 28 full mnist-0, 116 full mnist-90, 23 full mnist-180. 74 full mnist-270 total 241 data points.",
        "client_26": "Mixture of mnist and 3 other mnist rotation data. 55 full mnist-0, 86 full mnist-90, 74 full mnist-180. 35 full mnist-270 total 250 data points.",
        "client_27": "Mixture of mnist and 3 other mnist rotation data. 206 full mnist-0, 10 full mnist-90, 1 full mnist-180. 40 full mnist-270 total 257 data points.",
        "client_28": "Mixture of mnist and 3 other mnist rotation data. 108 full mnist-0, 88 full mnist-90, 67 full mnist-180. 32 full mnist-270 total 295 data points.",
        "client_29": "Mixture of mnist and 3 other mnist rotation data. 21 full mnist-0, 12 full mnist-90, 159 full mnist-180. 9 full mnist-270 total 201 data points.",
        "client_30": "Mixture of mnist and 3 other mnist rotation data. 0 full mnist-0, 8 full mnist-90, 51 full mnist-180. 196 full mnist-270 total 255 data points.",
        "client_31": "Mixture of mnist and 3 other mnist rotation data. 33 full mnist-0, 33 full mnist-90, 91 full mnist-180. 67 full mnist-270 total 224 data points.",
        "client_32": "Mixture of mnist and 3 other mnist rotation data. 39 full mnist-0, 16 full mnist-90, 129 full mnist-180. 55 full mnist-270 total 239 data points.",
        "client_33": "Mixture of mnist and 3 other mnist rotation data. 18 full mnist-0, 35 full mnist-90, 39 full mnist-180. 116 full mnist-270 total 208 data points.",
        "client_34": "Mixture of mnist and 3 other mnist rotation data. 158 full mnist-0, 22 full mnist-90, 38 full mnist-180. 5 full mnist-270 total 223 data points.",
        "client_35": "Mixture of mnist and 3 other mnist rotation data. 43 full mnist-0, 99 full mnist-90, 69 full mnist-180. 53 full mnist-270 total 264 data points.",
        "client_36": "Mixture of mnist and 3 other mnist rotation data. 82 full mnist-0, 75 full mnist-90, 56 full mnist-180. 19 full mnist-270 total 232 data points.",
        "client_37": "Mixture of mnist and 3 other mnist rotation data. 96 full mnist-0, 60 full mnist-90, 41 full mnist-180. 16 full mnist-270 total 213 data points.",
        "client_38": "Mixture of mnist and 3 other mnist rotation data. 63 full mnist-0, 74 full mnist-90, 16 full mnist-180. 71 full mnist-270 total 224 data points.",
        "client_39": "Mixture of mnist and 3 other mnist rotation data. 94 full mnist-0, 135 full mnist-90, 26 full mnist-180. 30 full mnist-270 total 285 data points.",
        "client_40": "Mixture of mnist and 3 other mnist rotation data. 59 full mnist-0, 10 full mnist-90, 105 full mnist-180. 48 full mnist-270 total 222 data points.",
        "client_41": "Mixture of mnist and 3 other mnist rotation data. 65 full mnist-0, 35 full mnist-90, 33 full mnist-180. 146 full mnist-270 total 279 data points.",
        "client_42": "Mixture of mnist and 3 other mnist rotation data. 68 full mnist-0, 35 full mnist-90, 106 full mnist-180. 8 full mnist-270 total 217 data points.",
        "client_43": "Mixture of mnist and 3 other mnist rotation data. 46 full mnist-0, 188 full mnist-90, 44 full mnist-180. 12 full mnist-270 total 290 data points.",
        "client_44": "Mixture of mnist and 3 other mnist rotation data. 9 full mnist-0, 5 full mnist-90, 242 full mnist-180. 30 full mnist-270 total 286 data points.",
        "client_45": "Mixture of mnist and 3 other mnist rotation data. 37 full mnist-0, 101 full mnist-90, 62 full mnist-180. 5 full mnist-270 total 205 data points.",
        "client_46": "Mixture of mnist and 3 other mnist rotation data. 55 full mnist-0, 67 full mnist-90, 57 full mnist-180. 63 full mnist-270 total 242 data points.",
        "client_47": "Mixture of mnist and 3 other mnist rotation data. 69 full mnist-0, 24 full mnist-90, 27 full mnist-180. 148 full mnist-270 total 268 data points.",
        "client_48": "Mixture of mnist and 3 other mnist rotation data. 49 full mnist-0, 42 full mnist-90, 134 full mnist-180. 15 full mnist-270 total 240 data points.",
        "client_49": "Mixture of mnist and 3 other mnist rotation data. 53 full mnist-0, 92 full mnist-90, 27 full mnist-180. 53 full mnist-270 total 225 data points.",
        "client_50": "Mixture of mnist and 3 other mnist rotation data. 27 full mnist-0, 0 full mnist-90, 98 full mnist-180. 162 full mnist-270 total 287 data points.",
        "client_51": "Mixture of mnist and 3 other mnist rotation data. 24 full mnist-0, 96 full mnist-90, 22 full mnist-180. 66 full mnist-270 total 208 data points.",
        "client_52": "Mixture of mnist and 3 other mnist rotation data. 121 full mnist-0, 94 full mnist-90, 8 full mnist-180. 73 full mnist-270 total 296 data points.",
        "client_53": "Mixture of mnist and 3 other mnist rotation data. 97 full mnist-0, 56 full mnist-90, 65 full mnist-180. 58 full mnist-270 total 276 data points.",
        "client_54": "Mixture of mnist and 3 other mnist rotation data. 113 full mnist-0, 78 full mnist-90, 2 full mnist-180. 23 full mnist-270 total 216 data points.",
        "client_55": "Mixture of mnist and 3 other mnist rotation data. 19 full mnist-0, 3 full mnist-90, 160 full mnist-180. 95 full mnist-270 total 277 data points.",
        "client_56": "Mixture of mnist and 3 other mnist rotation data. 39 full mnist-0, 74 full mnist-90, 55 full mnist-180. 121 full mnist-270 total 289 data points.",
        "client_57": "Mixture of mnist and 3 other mnist rotation data. 27 full mnist-0, 96 full mnist-90, 29 full mnist-180. 105 full mnist-270 total 257 data points.",
        "client_58": "Mixture of mnist and 3 other mnist rotation data. 22 full mnist-0, 158 full mnist-90, 7 full mnist-180. 58 full mnist-270 total 245 data points.",
        "client_59": "Mixture of mnist and 3 other mnist rotation data. 62 full mnist-0, 62 full mnist-90, 77 full mnist-180. 26 full mnist-270 total 227 data points.",
        "client_60": "Mixture of mnist and 3 other mnist rotation data. 41 full mnist-0, 62 full mnist-90, 153 full mnist-180. 13 full mnist-270 total 269 data points.",
        "client_61": "Mixture of mnist and 3 other mnist rotation data. 111 full mnist-0, 6 full mnist-90, 54 full mnist-180. 57 full mnist-270 total 228 data points.",
        "client_62": "Mixture of mnist and 3 other mnist rotation data. 35 full mnist-0, 49 full mnist-90, 91 full mnist-180. 26 full mnist-270 total 201 data points.",
        "client_63": "Mixture of mnist and 3 other mnist rotation data. 37 full mnist-0, 142 full mnist-90, 21 full mnist-180. 12 full mnist-270 total 212 data points.",
        "client_64": "Mixture of mnist and 3 other mnist rotation data. 25 full mnist-0, 21 full mnist-90, 86 full mnist-180. 112 full mnist-270 total 244 data points.",
        "client_65": "Mixture of mnist and 3 other mnist rotation data. 29 full mnist-0, 27 full mnist-90, 133 full mnist-180. 46 full mnist-270 total 235 data points.",
        "client_66": "Mixture of mnist and 3 other mnist rotation data. 33 full mnist-0, 82 full mnist-90, 76 full mnist-180. 89 full mnist-270 total 280 data points.",
        "client_67": "Mixture of mnist and 3 other mnist rotation data. 109 full mnist-0, 97 full mnist-90, 27 full mnist-180. 27 full mnist-270 total 260 data points.",
        "client_68": "Mixture of mnist and 3 other mnist rotation data. 105 full mnist-0, 156 full mnist-90, 5 full mnist-180. 12 full mnist-270 total 278 data points.",
        "client_69": "Mixture of mnist and 3 other mnist rotation data. 146 full mnist-0, 90 full mnist-90, 23 full mnist-180. 25 full mnist-270 total 284 data points.",
        "client_70": "Mixture of mnist and 3 other mnist rotation data. 31 full mnist-0, 53 full mnist-90, 10 full mnist-180. 178 full mnist-270 total 272 data points.",
        "client_71": "Mixture of mnist and 3 other mnist rotation data. 76 full mnist-0, 28 full mnist-90, 45 full mnist-180. 61 full mnist-270 total 210 data points.",
        "client_72": "Mixture of mnist and 3 other mnist rotation data. 11 full mnist-0, 37 full mnist-90, 35 full mnist-180. 118 full mnist-270 total 201 data points.",
        "client_73": "Mixture of mnist and 3 other mnist rotation data. 30 full mnist-0, 4 full mnist-90, 62 full mnist-180. 114 full mnist-270 total 210 data points.",
        "client_74": "Mixture of mnist and 3 other mnist rotation data. 29 full mnist-0, 12 full mnist-90, 133 full mnist-180. 67 full mnist-270 total 241 data points.",
        "client_75": "Mixture of mnist and 3 other mnist rotation data. 17 full mnist-0, 114 full mnist-90, 14 full mnist-180. 149 full mnist-270 total 294 data points.",
        "client_76": "Mixture of mnist and 3 other mnist rotation data. 106 full mnist-0, 83 full mnist-90, 31 full mnist-180. 12 full mnist-270 total 232 data points.",
        "client_77": "Mixture of mnist and 3 other mnist rotation data. 81 full mnist-0, 53 full mnist-90, 21 full mnist-180. 58 full mnist-270 total 213 data points.",
        "client_78": "Mixture of mnist and 3 other mnist rotation data. 53 full mnist-0, 43 full mnist-90, 70 full mnist-180. 110 full mnist-270 total 276 data points.",
        "client_79": "Mixture of mnist and 3 other mnist rotation data. 30 full mnist-0, 54 full mnist-90, 21 full mnist-180. 98 full mnist-270 total 203 data points.",
        "client_80": "Mixture of mnist and 3 other mnist rotation data. 13 full mnist-0, 22 full mnist-90, 169 full mnist-180. 69 full mnist-270 total 273 data points.",
        "client_81": "Mixture of mnist and 3 other mnist rotation data. 5 full mnist-0, 38 full mnist-90, 120 full mnist-180. 45 full mnist-270 total 208 data points.",
        "client_82": "Mixture of mnist and 3 other mnist rotation data. 199 full mnist-0, 48 full mnist-90, 27 full mnist-180. 14 full mnist-270 total 288 data points.",
        "client_83": "Mixture of mnist and 3 other mnist rotation data. 24 full mnist-0, 159 full mnist-90, 33 full mnist-180. 82 full mnist-270 total 298 data points.",
        "client_84": "Mixture of mnist and 3 other mnist rotation data. 133 full mnist-0, 15 full mnist-90, 30 full mnist-180. 23 full mnist-270 total 201 data points.",
        "client_85": "Mixture of mnist and 3 other mnist rotation data. 39 full mnist-0, 12 full mnist-90, 108 full mnist-180. 82 full mnist-270 total 241 data points.",
        "client_86": "Mixture of mnist and 3 other mnist rotation data. 170 full mnist-0, 72 full mnist-90, 5 full mnist-180. 53 full mnist-270 total 300 data points.",
        "client_87": "Mixture of mnist and 3 other mnist rotation data. 100 full mnist-0, 13 full mnist-90, 117 full mnist-180. 40 full mnist-270 total 270 data points.",
        "client_88": "Mixture of mnist and 3 other mnist rotation data. 57 full mnist-0, 9 full mnist-90, 74 full mnist-180. 81 full mnist-270 total 221 data points.",
        "client_89": "Mixture of mnist and 3 other mnist rotation data. 33 full mnist-0, 19 full mnist-90, 96 full mnist-180. 60 full mnist-270 total 208 data points.",
        "client_90": "Mixture of mnist and 3 other mnist rotation data. 8 full mnist-0, 141 full mnist-90, 104 full mnist-180. 11 full mnist-270 total 264 data points.",
        "client_91": "Mixture of mnist and 3 other mnist rotation data. 138 full mnist-0, 113 full mnist-90, 14 full mnist-180. 30 full mnist-270 total 295 data points.",
        "client_92": "Mixture of mnist and 3 other mnist rotation data. 27 full mnist-0, 70 full mnist-90, 68 full mnist-180. 54 full mnist-270 total 219 data points.",
        "client_93": "Mixture of mnist and 3 other mnist rotation data. 55 full mnist-0, 97 full mnist-90, 96 full mnist-180. 46 full mnist-270 total 294 data points.",
        "client_94": "Mixture of mnist and 3 other mnist rotation data. 32 full mnist-0, 31 full mnist-90, 98 full mnist-180. 65 full mnist-270 total 226 data points.",
        "client_95": "Mixture of mnist and 3 other mnist rotation data. 130 full mnist-0, 55 full mnist-90, 15 full mnist-180. 86 full mnist-270 total 286 data points.",
        "client_96": "Mixture of mnist and 3 other mnist rotation data. 31 full mnist-0, 219 full mnist-90, 23 full mnist-180. 27 full mnist-270 total 300 data points.",
        "client_97": "Mixture of mnist and 3 other mnist rotation data. 141 full mnist-0, 40 full mnist-90, 63 full mnist-180. 10 full mnist-270 total 254 data points.",
        "client_98": "Mixture of mnist and 3 other mnist rotation data. 159 full mnist-0, 91 full mnist-90, 34 full mnist-180. 11 full mnist-270 total 295 data points.",
        "client_99": "Mixture of mnist and 3 other mnist rotation data. 7 full mnist-0, 30 full mnist-90, 29 full mnist-180. 150 full mnist-270 total 216 data points."
    }
}